---
kind: property
id: P:Autodesk.Revit.DB.PDFExportOptions.AlwaysUseRaster
source: html/57082915-eb49-d59d-8aa0-f16e7e8a95e0.htm
---
# Autodesk.Revit.DB.PDFExportOptions.AlwaysUseRaster Property

If true completely use raster processing for graphics,
 otherwise use vector processing as much as possible.

## Syntax (C#)
```csharp
public bool AlwaysUseRaster { get; set; }
```